cf/InformationRegisters/DocumentsNumberingSettings.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>DocumentsNumberingSettings</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Prefix</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>18</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>InitialCounter</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>5</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Attribute</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>DocumentType</Name>
					<Type>
						<v8:TypeSet>cfg:BusinessProcessRef</v8:TypeSet>
						<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
						<v8:TypeSet>cfg:TaskRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>AttributeValue</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
						<v8:NumberQualifiers>
							<v8:Digits>16</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cf/InformationRegisters/DocumentsNumberingSettings/Forms/RecordForm/Ext/Form/Module.bsl
&AtServer
Procedure OnCreateAtServer(Cancel, StandardProcessing)
	
	Items.DocumentType.ChoiceList.Clear();
	
	AvailableTypes = Metadata.InformationRegisters.DocumentsNumberingSettings.Dimensions.DocumentType.Type;
	
	For Each MetadataObject In Metadata.Documents Do
		
		EmptyRef = Documents[MetadataObject.Name].EmptyRef();
		
		If AvailableTypes.ContainsType(TypeOf(EmptyRef)) Then
			Items.DocumentType.ChoiceList.Add(Documents[MetadataObject.Name].EmptyRef(),MetadataObject.Synonym);
		EndIf;
		
	EndDo;
	
	Items.DocumentType.ChoiceList.SortByPresentation();
	
EndProcedure

&AtClient
Procedure OnOpen(Cancel)
	LabelMaxNumberText = Items.DecorationLabelMaxNumber.Title;
	UpdateDialog();
EndProcedure

&AtClient
Procedure DocumentTypeOnChange(Item)
	UpdateDialog();
EndProcedure

&AtClient
Procedure PrefixOnChange(Item)
	UpdateDialog();
EndProcedure

&AtClient
Procedure InitialCounterOnChange(Item)
	UpdateDialog();
EndProcedure

&AtClient
Procedure UpdateDialog()
	
	SampleNumber = TrimAll(DocumentsPostingAndNumberingAtClientAtServer.ReplacePrefixTokens_Date(Record.Prefix, CurrentDate())) + TrimAll(Record.InitialCounter);
	
	If Record.DocumentType = Undefined Then
		Items.DecorationLabelMaxNumber.Title = NStr("en='Please, choose document type.';pl='Wybierz typ dokumentu.';ru='Выберите тип документа.'");
	Else
		Items.DecorationLabelMaxNumber.Title = Alerts.ParametrizeString(LabelMaxNumberText, New Structure("P1", ObjectsExtensionsAtServer.GetDocumentNumberLength(Record.DocumentType)));
	EndIf;
	
EndProcedure
